src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>пбп_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:Type>d5p1:CatalogRef.пбп_ПользовательскиеФункции</v8:Type>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэшируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения/Ext/ManagerModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по идентификатору
//
// Параметры:
//  Ссылка					 - ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылка на предопределенный элемент.
//  ВыбрасыватьИсключение	 - Булево - выбрасывать исключение, если есть ошибки.
//  ЗначениеПоУмолчанию		 - ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения, Неопределено - значение,
//                             которое возвращается, если предопределенного не существует.
//                             Если не указано, возвращается значение Неопределено.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
//
Функция ПолучитьЗначение(Ссылка, ВыбрасыватьИсключение = Ложь, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Значение = ЗначенияПредопределенныхЭлементов(Ссылка);
	
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает соответствие предопределенных элементов ПВХ по Идентификаторам
//
// Параметры:
//  Ссылки					 - Массив из ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылки
//                             на предопределенные элементы.
//  ВыбрасыватьИсключение	 - Булево	 - выбрасывать исключение, если есть ошибки.
//  ВРазрезеКлючей			 - Булево	 - признак получения данных в виде соответствия, где Ключ - Имя переменной.
// 
// Возвращаемое значение:
//   - Соответствие - Соответствие имен и значений переменных ПВХ.
//  - Массив - Массив значений переменных ПВХ.
//
Функция ПолучитьЗначения(Ссылки, ВыбрасыватьИсключение = Ложь, ВРазрезеКлючей = Ложь) Экспорт
	
	Значения = ЗначенияПредопределенныхЭлементов(Ссылки, Истина, ВРазрезеКлючей);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Значения предопределенных элементов по идентификаторам
//
// Параметры:
//  Ссылки					 - ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылка на предопределенный элемент.
//							 - Массив из ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения - ссылки на предопределенные элементы.
//  МножественныйВыбор		 - Булево - Ложь - вернется одно значение произвольного типа,
//								        Истина - вернется массив или соответствие в разрезе ключей со значениями
//  ВРазрезеКлючей			 - Булево - Ложь - вернется массив значений без учета идентификаторов,
//								        Истина - вернется соответствие со значениями в разрезе ключей
//  ВыбрасыватьИсключение	 - Булево - выбрасывать исключение, если есть ошибки.
//
// Возвращаемое значение:
//  Массив - содержит значение предопределенных элементов в порядке, в котором были переданы идентификаторы.
//  Соответствие из КлючИЗначение - список идентификаторов и значений элементов:
//   * Ключ - Строка - ИдентификаторНастройки;
//   * Значение - Произвольный - значение элемента
//
Функция ЗначенияПредопределенныхЭлементов(Знач Ссылки,
	МножественныйВыбор = Ложь,
	ВРазрезеКлючей = Ложь,
	ВыбрасыватьИсключение = Ложь)
	
	Если ТипЗнч(Ссылки) = Тип("ПланВидовХарактеристикСсылка.пбп_ПредопределенныеЗначения") Тогда
		Ссылки = пбп_ПереадресацияКлиентСервер.ЗначениеВМассиве(Ссылки);
	КонецЕсли;
	
	Результат = Неопределено;
	Если МножественныйВыбор Тогда
		Если ВРазрезеКлючей Тогда
			Результат = Новый Соответствие;
		Иначе
			Результат = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Ссылки) <> Тип("Массив") Тогда
		Если ВыбрасыватьИсключение Тогда
			ВызватьИсключение (пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный тип первого параметра ''%1'', ожидалось <Массив>'"),
				"Ссылки"),
				КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
	
	ДанныеПредопределенныхЗначений = ПолучитьДанныеПредопределенныхЗначений(Ссылки, МножественныйВыбор);
	ВыборкаСписок = ДанныеПредопределенныхЗначений.ВыборкаСписок;
	ВыборкаЗначения = ДанныеПредопределенныхЗначений.ВыборкаЗначения;
	
	// список значений
	Пока ВыборкаСписок.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаСписок.Выбрать();
		Значение = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Значение.Добавить(ВыборкаДетальныеЗаписи.Значение);
		КонецЦикла;
		пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(
			Результат, Значение, ВыборкаСписок.Ссылка, МножественныйВыбор);
	КонецЦикла;
	
	// значение и пароль
	Пока ВыборкаЗначения.Следующий() Цикл
		Если ВыборкаЗначения.Пароль Тогда
			УИД = ВыборкаЗначения.Ссылка.УникальныйИдентификатор();
			Значение = ПолучитьПарольПоИдентификатору(УИД);
		Иначе
			Значение = ВыборкаЗначения.Значение;
		КонецЕсли;
		пбп_ПредопределенныеЗначения.ДополнитьЗначенияПредопределенных(
			Результат, Значение, ВыборкаЗначения.Ссылка, МножественныйВыбор);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПредопределенныхЗначений(Ссылки, МножественныйВыбор = Ложь)
	
	ДанныеПредопределенныхЗначений = Новый Структура;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	пбп_ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	пбп_ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	пбп_ПредопределенныеЗначения.Пароль КАК Пароль,
		|	пбп_ПредопределенныеЗначения.Значение КАК Значение
		|ПОМЕСТИТЬ Предопределенные
		|ИЗ
		|	ПланВидовХарактеристик.пбп_ПредопределенныеЗначения КАК пбп_ПредопределенныеЗначения
		|ГДЕ
		|	пбп_ПредопределенныеЗначения.Ссылка В(&Ссылки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	ПредопределенныеЗначения.СписокЗначений КАК СписокЗначений,
		|	ПредопределенныеЗначения.Пароль КАК Пароль,
		|	ВЫБОР
		|		КОГДА ПредопределенныеЗначения.СписокЗначений
		|			ТОГДА пбп_ПредопределенныеЗначенияЗначенияЭлементов.Значение
		|		КОГДА НЕ ПредопределенныеЗначения.Пароль
		|			ТОГДА ПредопределенныеЗначения.Значение
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ЗначенияПредопределенных
		|ИЗ
		|	Предопределенные КАК ПредопределенныеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.пбп_ПредопределенныеЗначения.ЗначенияЭлементов КАК пбп_ПредопределенныеЗначенияЗначенияЭлементов
		|		ПО ПредопределенныеЗначения.Ссылка = пбп_ПредопределенныеЗначенияЗначенияЭлементов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПредопределенных.Ссылка КАК Ссылка,
		|	ЗначенияПредопределенных.Значение КАК Значение
		|ИЗ
		|	ЗначенияПредопределенных КАК ЗначенияПредопределенных
		|ГДЕ
		|	ЗначенияПредопределенных.СписокЗначений
		|	И НЕ ЗначенияПредопределенных.Значение ЕСТЬ NULL
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПредопределенных.Ссылка КАК Ссылка,
		|	ЗначенияПредопределенных.Пароль КАК Пароль,
		|	ЗначенияПредопределенных.Значение КАК Значение
		|ИЗ
		|	ЗначенияПредопределенных КАК ЗначенияПредопределенных
		|ГДЕ
		|	НЕ ЗначенияПредопределенных.СписокЗначений";
	
	Если Не МножественныйВыбор Тогда
		Схема = Новый СхемаЗапроса;
		Схема.УстановитьТекстЗапроса(ТекстЗапроса);
		ОператорВыбрать = Схема.ПакетЗапросов[0].Операторы[0];
		
		ОператорВыбрать.КоличествоПолучаемыхЗаписей = 1;
		
		ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеПредопределенныхЗначений.Вставить("ВыборкаСписок",
		РезультатыЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеПредопределенныхЗначений.Вставить("ВыборкаЗначения", РезультатыЗапроса[3].Выбрать());
	
	Возврат ДанныеПредопределенныхЗначений;
	
КонецФункции

Функция ПолучитьПарольПоИдентификатору(УИД)
	
	ДанныеХранилища = пбп_Переадресация.ПрочитатьДанныеИзБезопасногоХранилища(Строка(УИД));
	
	Значение = "";
	Если ТипЗнч(ДанныеХранилища) = Тип("Структура") Тогда
		Значение = пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "");
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
